<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>&#1497;&#1510;&#1497;&#1512;&#1514; &#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;</title>
</head>
<body style="direction: rtl;">
<h1>&#1497;&#1510;&#1497;&#1512;&#1514; &#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;</h1>
<br>
&#1500;&#1488;&#1495;&#1512; &#1489;&#1504;&#1497;&#1497;&#1514; &#1506;&#1509; &#1491;&#1506;&#1514; &#1512;&#1495;&#1489; &#1489;&#1506;&#1500; &#1502;&#1505;&#1508;&#1512; &#1512;&#1489; &#1513;&#1500; &#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1493;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501;, &#1504;&#1497;&#1514;&#1503; &#1500;&#1497;&#1510;&#1493;&#1512; &#1502;&#1502;&#1504;&#1493; &#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;.<br>
&#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496; &#1494;&#1492; &#1497;&#1492;&#1497;&#1492; &#1504;&#1490;&#1497;&#1513; &#1500;&#1499;&#1500; &#1502;&#1513;&#1514;&#1502;&#1513; &#1488;&#1513;&#1512; &#1497;&#1512;&#1510;&#1492; &#1500;&#1506;&#1497;&#1497;&#1503; &#1489;&#1506;&#1509; &#1492;&#1491;&#1506;&#1514; &#1513;&#1504;&#1493;&#1510;&#1512;, &#1500;&#1500;&#1488; &#1510;&#1493;&#1512;&#1498; &#1489;&#1492;&#1514;&#1511;&#1504;&#1514; Eclipse &#1488;&#1493; &#1514;&#1493;&#1499;&#1504;&#1493;&#1514; &#1499;&#1500;&#1513;&#1492;&#1503; &#1506;&#1500; &#1502;&#1495;&#1513;&#1489;&#1493; &#1492;&#1488;&#1497;&#1513;&#1497;.<br>
<h2>&#1497;&#1510;&#1497;&#1512;&#1514; &#1492;&#1488;&#1514;&#1512;</h2>
&#1500;&#1488;&#1495;&#1512; &#1513;&#1492;&#1506;&#1489;&#1493;&#1491;&#1492; &#1506;&#1500; &#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1492;&#1505;&#1514;&#1497;&#1497;&#1502;&#1492;, &#1497;&#1513; &#1500;&#1500;&#1495;&#1493;&#1509; &#1500;&#1495;&#1497;&#1510;&#1492; &#1497;&#1502;&#1504;&#1497;&#1514; &#1506;&#1500; &#1514;&#1497;&#1511;&#1497;&#1497;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1493;&#1500;&#1489;&#1495;&#1493;&#1512; &#1489; "&#1510;&#1493;&#1512; &#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;":<br>
<br>
<img style="width: 1004px; height: 728px;" alt="Eclipse Export Menu" src="../screen_shots/htmlexport1.png"><br>
<br>
<br>
&#1500;&#1488;&#1495;&#1512; &#1505;&#1497;&#1493;&#1501; &#1492;&#1497;&#1510;&#1497;&#1512;&#1492;, &#1514;&#1514;&#1493;&#1493;&#1505;&#1507; &#1514;&#1497;&#1511;&#1497;&#1497;&#1492; &#1495;&#1491;&#1513;&#1492; &#1489;&#1513;&#1501; html &#1500;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;:<br>
<img style="width: 268px; height: 392px;" alt="Navigator with html dir" src="../screen_shots/htmlexport2.png"><br>
<br>
&#1488;&#1501; &#1504;&#1508;&#1514;&#1495; &#1488;&#1514; &#1492;&#1514;&#1497;&#1511;&#1497;&#1497;&#1492; &#1493;&#1504;&#1499;&#1504;&#1505; &#1500;&#1511;&#1493;&#1489;&#1509; &#1492;&#1512;&#1488;&#1513;&#1497; &#1513;&#1500; &#1492;&#1488;&#1514;&#1512; (index.html) &#1488;&#1494;&#1497; &#1497;&#1508;&#1514;&#1495; &#1495;&#1500;&#1493;&#1503; &#1492;&#1491;&#1508;&#1491;&#1508;&#1503; &#1493;&#1497;&#1493;&#1510;&#1490; &#1488;&#1514;&#1512; &#1492;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496; &#1492;&#1495;&#1491;&#1513;:<br>
<img style="width: 907px; height: 681px;" alt="The ToK html site" src="../screen_shots/htmlexport3.png"><br>
<br>
<br>
<h2>&#1513;&#1497;&#1502;&#1493;&#1513; &#1489;&#1488;&#1514;&#1512;</h2>
&#1492;&#1488;&#1514;&#1512; &#1502;&#1499;&#1497;&#1500; &#1514;&#1508;&#1512;&#1497;&#1496; &#1489;&#1510;&#1491; &#1497;&#1502;&#1497;&#1503; &#1492;&#1502;&#1488;&#1508;&#1513;&#1512; &#1490;&#1497;&#1513;&#1492; &#1500;&#1499;&#1500; &#1511;&#1489;&#1510;&#1497; &#1492;&#1488;&#1514;&#1512;. &#1492;&#1514;&#1508;&#1512;&#1497;&#1496; &#1502;&#1499;&#1497;&#1500; &#1514;&#1497;&#1511;&#1497;&#1493;&#1514; &#1489;&#1492;&#1514;&#1488;&#1501; &#1500;&#1514;&#1497;&#1511;&#1497;&#1493;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1492;&#1502;&#1511;&#1493;&#1512;&#1497;.<br>
&#1499;&#1502;&#1493; &#1499;&#1503;, &#1502;&#1499;&#1500; &#1513;&#1493;&#1512;&#1513; &#1504;&#1497;&#1514;&#1503; &#1500;&#1490;&#1513;&#1514; &#1500;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501; &#1492;&#1504;&#1493;&#1490;&#1506;&#1497;&#1501; &#1488;&#1500;&#1497;&#1493;. &#1492;&#1500;&#1497;&#1504;&#1511;&#1497;&#1501; &#1510;&#1489;&#1493;&#1506;&#1497;&#1501; &#1489;&#1510;&#1489;&#1506;&#1497;&#1501;
&#1513;&#1493;&#1504;&#1497;&#1501; &#1500;&#1508;&#1497; &#1505;&#1493;&#1490; &#1492;&#1511;&#1497;&#1513;&#1493;&#1512; &#1513;&#1500; &#1492;&#1491;&#1497;&#1493;&#1503; &#1492;&#1502;&#1511;&#1493;&#1513;&#1512;. &#1488;&#1501; &#1513;&#1504;&#1497; &#1491;&#1497;&#1493;&#1504;&#1497;&#1501; &#1502;&#1511;&#1493;&#1513;&#1512;&#1497;&#1501; &#1500;&#1488;&#1493;&#1514;&#1493; &#1502;&#1511;&#1496;&#1506;
&#1489;&#1513;&#1493;&#1512;&#1513;, &#1500;&#1495;&#1497;&#1510;&#1492; &#1506;&#1500; &#1492;&#1500;&#1497;&#1504;&#1511; &#1514;&#1493;&#1489;&#1497;&#1500; &#1500;&#1506;&#1502;&#1493;&#1491; &#1489;&#1493; &#1504;&#1514;&#1489;&#1511;&#1513; &#1500;&#1489;&#1495;&#1493;&#1512; &#1489;&#1497;&#1504;&#1492;&#1501;.<br>
&#1499;&#1500; &#1491;&#1497;&#1493;&#1503; &#1502;&#1499;&#1497;&#1500; &#1511;&#1497;&#1513;&#1493;&#1512;&#1497;&#1501; &#1500;&#1499;&#1500; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1513;&#1492;&#1493;&#1488; &#1502;&#1510;&#1493;&#1496;&#1496; &#1502;&#1492;&#1501;.<br>
<br>
&#1492;&#1513;&#1492;&#1497;&#1497;&#1514; &#1492;&#1506;&#1499;&#1489;&#1512; &#1502;&#1506;&#1500; &#1488;&#1495;&#1491; &#1492;&#1500;&#1497;&#1504;&#1511;&#1497;&#1501; &#1514;&#1493;&#1489;&#1497;&#1500; &#1489;&#1512;&#1493;&#1489; &#1492;&#1502;&#1511;&#1512;&#1497;&#1501; &#1500;&#1492;&#1510;&#1490;&#1514; &#1502;&#1497;&#1491;&#1506; &#1504;&#1493;&#1505;&#1507; (tooltip) &#1506;&#1500; &#1492;&#1491;&#1507; &#1492;&#1502;&#1511;&#1493;&#1513;&#1512;.<br>
<br>
<h2>&#1492;&#1506;&#1500;&#1488;&#1514; &#1492;&#1488;&#1514;&#1512; &#1500;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;</h2>
&#1489;&#1490;&#1512;&#1505;&#1492; &#1494;&#1493; &#1513;&#1500; &#1492;&#1502;&#1493;&#1510;&#1512; &#1488;&#1504;&#1493; &#1506;&#1491;&#1497;&#1497;&#1503; &#1500;&#1488; &#1514;&#1493;&#1502;&#1499;&#1497;&#1501; &#1489;&#1492;&#1506;&#1500;&#1488;&#1514; &#1492;&#1488;&#1514;&#1512; &#1500;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;. &#1489;&#1502;&#1497;&#1491;&#1492;
&#1493;&#1489;&#1512;&#1513;&#1493;&#1514;&#1499;&#1501; &#1513;&#1512;&#1514; &#1488;&#1493; &#1502;&#1511;&#1493;&#1501; &#1488;&#1495;&#1505;&#1493;&#1503; &#1499;&#1500;&#1513;&#1492;&#1493;, &#1492;&#1506;&#1514;&#1497;&#1511;&#1493; &#1488;&#1514; &#1499;&#1500; &#1514;&#1497;&#1511;&#1497;&#1497;&#1514; &#1492; html &#1513;&#1500;&#1499;&#1501; &#1500;&#1513;&#1512;&#1514;.
&#1492;&#1488;&#1514;&#1512; &#1497;&#1492;&#1497;&#1492; &#1489;&#1488;&#1493;&#1493;&#1497;&#1512; &#1493;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1497;&#1493;&#1499;&#1500;&#1493; &#1500;&#1490;&#1513;&#1514; &#1488;&#1500;&#1497;&#1493; &#1502;&#1499;&#1500; &#1502;&#1511;&#1493;&#1501;.<br>
&#1492;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1489;&#1491;&#1497;&#1493;&#1503; &#1513;&#1497;&#1497;&#1510;&#1512;&#1514;&#1501; &#1500;&#1488; &#1497;&#1510;&#1496;&#1512;&#1499;&#1493; &#1500;&#1492;&#1514;&#1511;&#1497;&#1503; &#1514;&#1493;&#1499;&#1504;&#1493;&#1514; &#1502;&#1505;&#1493;&#1489;&#1499;&#1493;&#1514; &#1506;&#1500; &#1492;&#1502;&#1495;&#1513;&#1489; &#1513;&#1500;&#1492;&#1501; &#1499;&#1491;&#1497; &#1500;&#1510;&#1508;&#1493;&#1514; &#1489;&#1506;&#1489;&#1493;&#1491;&#1514;&#1499;&#1501;.
</body>
</html>
