<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


  
  
  <title>Source Parser</title>
</head>


<body style="direction: rtl;">





<h1>&#1502;&#1508;&#1506;&#1504;&#1495; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</h1>
<p class="MsoNormal" dir="rtl"><span dir="ltr"><o:p></o:p></span>&#1502;&#1508;&#1506;&#1504;&#1495; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514; (Source Parser) &#1492;&#1493;&#1488; &#1499;&#1500;&#1497; &#1488;&#1513;&#1512; <span lang="HE">&#1502;&#1488;&#1508;&#1513;&#1512; &#1500;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1492;&#1508;&#1493;&#1498; &#1502;&#1505;&#1502;&#1498;
&#1502;&#1511;&#1493;&#1512; &#1496;&#1511;&#1505;&#1496;&#1493;&#1488;&#1500;&#1497;</span><span dir="ltr"></span><span dir="ltr" lang="HE"><span dir="ltr"></span>
</span><span lang="HE">&#1500;&#1502;&#1505;&#1502;&#1498; &#1502;&#1511;&#1493;&#1512;</span><span dir="ltr"></span><span dir="ltr"><span dir="ltr"></span>&nbsp;XML&nbsp; </span><span lang="HE">&#1488;&#1497;&#1514;&#1493; &#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1514;&#1491;&#1506; &#1500;&#1506;&#1489;&#1493;&#1491;</span><span dir="ltr"></span><span dir="ltr"><span dir="ltr"></span>.</span></p>



<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1502;&#1488;&#1508;&#1513;&#1512;&#1514; &#1500;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1497;&#1497;&#1489;&#1488; &#1502;&#1511;&#1493;&#1512; &#1489;&#1508;&#1493;&#1512;&#1502;&#1496; </span><span dir="ltr">text</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span>,
&#1493;&#1502;&#1510;&#1497;&#1490;&#1492; &#1502;&#1504;&#1513;&#1511; &#1504;&#1493;&#1495; &#1500;&#1492;&#1502;&#1512;&#1514;&#1493; &#1500;&#1508;&#1493;&#1512;&#1502;&#1496; </span><span dir="ltr">XML</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span>. &#1489;&#1506;&#1494;&#1512;&#1514; &#1492;&#1502;&#1504;&#1513;&#1511; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1502;&#1490;&#1491;&#1497;&#1512; &#1492;&#1497;&#1512;&#1512;&#1499;&#1497;&#1492; &#1513;&#1500; &#1508;&#1512;&#1511;&#1497;&#1501; &#1493;&#1514;&#1514;&#1497;
&#1508;&#1512;&#1511;&#1497;&#1501;.<o:p></o:p></span></p>



<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1499;&#1491;&#1497; &#1500;&#1497;&#1497;&#1489;&#1488; &#1502;&#1511;&#1493;&#1512; &#1495;&#1491;&#1513;, &#1506;&#1500; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1489;&#1495;&#1493;&#1512; &#1489;:</span></p>
<p class="MsoNormal" style="" dir="rtl">&#1511;&#1493;&#1489;&#1509; -&gt; &#1495;&#1491;&#1513; -&gt; "&#1502;&#1511;&#1493;&#1512; &#1502;&#1496;&#1511;&#1505;&#1496;"<span lang="HE"><o:p></o:p></span></p>
<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1488;&#1494; &#1497;&#1493;&#1510;&#1490; &#1489;&#1508;&#1504;&#1497;&#1493; &#1492;&#1502;&#1505;&#1498; &#1492;&#1489;&#1488;:<o:p></o:p></span></p>

<p class="MsoNormal" style="" dir="rtl"><span lang="HE"><img style="width: 525px; height: 427px;" alt="parser" src="../screen_shots/parser.JPG"></span></p>

<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1497;&#1511;&#1500;&#1497;&#1491; &#1488;&#1514; &#1492;&#1508;&#1512;&#1496;&#1497;&#1501; &#1492;&#1502;&#1514;&#1488;&#1497;&#1502;&#1497;&#1501; &#1489;&#1502;&#1505;&#1502;&#1498;:</span><span lang="HE"></span></p>
<ul>
  <li>&#1499;&#1493;&#1514;&#1512;&#1514; - &#1513;&#1501; &#1492;&#1502;&#1505;&#1502;&#1498;, &#1499;&#1508;&#1497; &#1513;&#1497;&#1493;&#1510;&#1490; &#1489;&#1512;&#1488;&#1513; &#1492;&#1511;&#1493;&#1489;&#1509; (&#1513;&#1501; &#1492;&#1511;&#1493;&#1489;&#1509; &#1497;&#1492;&#1497;&#1492; &#1513;&#1501; &#1492;&#1511;&#1493;&#1489;&#1509; &#1492;&#1504;&#1493;&#1499;&#1495;&#1497;)</li>
  <li>&#1502;&#1495;&#1489;&#1512; - &#1513;&#1502;&#1493; &#1513;&#1500; &#1502;&#1495;&#1489;&#1512; &#1492;&#1502;&#1505;&#1502;&#1498;</li>
  <li>&#1502;&#1505;&#1500;&#1493;&#1500; &#1492;&#1502;&#1511;&#1493;&#1512; - &#1512;&#1510;&#1507; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1492;&#1490;&#1491;&#1493;&#1500;&#1497;&#1501; &#1502;&#1492;&#1501; &#1504;&#1500;&#1511;&#1495; &#1502;&#1505;&#1502;&#1498; &#1494;&#1492;. &#1504;&#1497;&#1514;&#1503; &#1500;&#1492;&#1513;&#1488;&#1497;&#1512; &#1512;&#1497;&#1511;.</li>
  <li>&#1508;&#1512;&#1493;&#1497;&#1511;&#1496; - &#1492;&#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1513;&#1488;&#1500;&#1497;&#1493; &#1497;&#1510;&#1493;&#1512;&#1507; &#1492;&#1502;&#1511;&#1493;&#1512;</li>
  <li>&#1513;&#1493;&#1512;&#1513; - &#1492;&#1488;&#1501; &#1502;&#1505;&#1502;&#1498; &#1494;&#1492; &#1497;&#1492;&#1497;&#1492; &#1513;&#1493;&#1512;&#1513; &#1488;&#1493; &#1500;&#1488;</li>
</ul>
<p class="MsoNormal" style="" dir="rtl"><span lang="HE"><o:p></o:p></span>&#1502;&#1505;&#1500;&#1493;&#1500;
&#1492;&#1502;&#1511;&#1493;&#1512; &#1495;&#1497;&#1497;&#1489; &#1500;&#1492;&#1497;&#1493;&#1514; &#1506;&#1501; &#1500;&#1493;&#1499;&#1505;&#1504;&#1497;&#1501; &#1511;&#1491;&#1502;&#1497;&#1497;&#1501; &#1489;&#1500;&#1489;&#1491; (&#1493;&#1494;&#1488;&#1514; &#1506;&#1500; &#1502;&#1504;&#1514; &#1500;&#1502;&#1504;&#1493;&#1506; &#1489;&#1500;&#1489;&#1493;&#1500; &#1489;&#1497;&#1503;
&#1500;&#1493;&#1499;&#1505;&#1504;&#1497;&#1501; &#1492;&#1502;&#1508;&#1512;&#1497;&#1491;&#1497;&#1501; &#1489;&#1497;&#1503; &#1505;&#1508;&#1512;&#1497;&#1501; &#1500;&#1500;&#1493;&#1499;&#1505;&#1504;&#1497;&#1501; &#1492;&#1508;&#1493;&#1499;&#1497;&#1501;). &#1502;&#1505;&#1500;&#1493;&#1500; &#1492;&#1502;&#1511;&#1493;&#1512; &#1495;&#1497;&#1497;&#1489; &#1513;&#1500;&#1488;
&#1500;&#1492;&#1505;&#1514;&#1497;&#1497;&#1501; &#1489;&#1500;&#1493;&#1499;&#1505;&#1503; (&#1513;&#1493;&#1489;, &#1506;&#1500; &#1502;&#1504;&#1514; &#1500;&#1502;&#1504;&#1493;&#1506; &#1489;&#1500;&#1489;&#1493;&#1500;).</p>



<h2 dir="rtl"><span lang="HE">&#1488;&#1493;&#1508;&#1503; &#1497;&#1510;&#1497;&#1512;&#1514; &#1502;&#1505;&#1502;&#1498; &#1492;</span><span dir="ltr">XML:</span><span lang="HE"><o:p></o:p></span></h2>



<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1500;&#1488;&#1495;&#1512; &#1492;&#1511;&#1500;&#1491;&#1514; &#1492;&#1508;&#1512;&#1496;&#1497;&#1501;, &#1492;&#1502;&#1505;&#1502;&#1498; &#1497;&#1493;&#1510;&#1490; &#1489;&#1508;&#1504;&#1497; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513;, &#1500;&#1500;&#1488; &#1499;&#1493;&#1514;&#1512;&#1493;&#1514;. &#1506;&#1500;
&#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1502;&#1511;&#1501; &#1488;&#1514; &#1492;&#1505;&#1502;&#1503; &#1489;&#1505;&#1493;&#1507; &#1499;&#1500; &#1508;&#1512;&#1511;, &#1493;&#1488;&#1494; &#1500;&#1500;&#1495;&#1493;&#1509; &#1506;&#1500; &#1499;&#1508;&#1514;&#1493;&#1512; "&#1510;&#1493;&#1512; &#1508;&#1512;&#1511; &#1495;&#1491;&#1513;" (&#1488;&#1493;
</span><span dir="ltr">ALT+Q</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span>). &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1497;&#1514;&#1489;&#1511;&#1513; &#1500;&#1492;&#1511;&#1500;&#1497;&#1491; &#1488;&#1514; &#1513;&#1501; &#1492;&#1508;&#1512;&#1511; &#1492;&#1495;&#1491;&#1513; (&#1497;&#1513; &#1500;&#1500;&#1495;&#1493;&#1509; </span><span dir="ltr">enter</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span>
&#1489;&#1505;&#1497;&#1493;&#1501; &#1492;&#1492;&#1511;&#1500;&#1491;&#1492;, &#1488;&#1493; </span><span dir="ltr">esc</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span> &#1500;&#1489;&#1497;&#1496;&#1493;&#1500;). &#1492;&#1508;&#1512;&#1511; &#1492;&#1495;&#1491;&#1513; &#1513;&#1497;&#1493;&#1493;&#1510;&#1512; &#1497;&#1493;&#1512;&#1499;&#1489; &#1502;&#1492;&#1496;&#1511;&#1505;&#1496; &#1489;&#1497;&#1503; &#1514;&#1495;&#1497;&#1500;&#1514;
&#1492;&#1508;&#1512;&#1511; &#1500;&#1502;&#1497;&#1511;&#1493;&#1501; &#1492;&#1505;&#1502;&#1503;.<o:p></o:p></span></p>



<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1499;&#1491;&#1497; &#1500;&#1497;&#1510;&#1493;&#1512; &#1514;&#1514;&#1497; &#1508;&#1512;&#1511;&#1497;&#1501; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1497;&#1502;&#1511;&#1501; &#1488;&#1514; &#1492;&#1505;&#1502;&#1503; &#1489;&#1488;&#1502;&#1510;&#1506; &#1508;&#1512;&#1511; &#1513;&#1499;&#1489;&#1512;
"&#1508;&#1493;&#1512;&#1505;&#1505;" (&#1499;&#1500;&#1493;&#1502;&#1512;, &#1504;&#1497;&#1514;&#1503; &#1500;&#1493; &#1513;&#1501;). &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1497;&#1489;&#1495;&#1512; &#1500;&#1497;&#1510;&#1493;&#1512; &#1508;&#1512;&#1511; &#1495;&#1491;&#1513;, &#1493;&#1492;&#1508;&#1512;&#1511; &#1492;&#1511;&#1497;&#1497;&#1501;
&#1497;&#1514;&#1508;&#1510;&#1500; &#1500;&#1513;&#1504;&#1497; &#1508;&#1512;&#1511;&#1497;&#1501;.<o:p></o:p></span></p>



<p class="MsoNormal" style="" dir="rtl"><span lang="HE">&#1500;&#1488;&#1495;&#1512; &#1513;&#1499;&#1500; &#1492;&#1496;&#1511;&#1505;&#1496; &#1508;&#1493;&#1512;&#1505;&#1505;, &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1497;&#1493;&#1499;&#1500; &#1500;&#1505;&#1497;&#1497;&#1501; &#1488;&#1514; &#1506;&#1489;&#1493;&#1491;&#1514;&#1493; &#1506;&#1500; &#1497;&#1491;&#1497; &#1492;&#1511;&#1497;&#1510;&#1493;&#1512; (</span><span dir="ltr">ctrl+S</span><span dir="rtl"></span><span lang="HE"><span dir="rtl"></span>)
&#1488;&#1493; &#1506;&#1500; &#1497;&#1491;&#1497; &#1489;&#1497;&#1510;&#1493;&#1506; &#1513;&#1502;&#1497;&#1512;&#1492; &#1512;&#1490;&#1497;&#1500;&#1492;.&nbsp;&#1488;&#1494; &#1497;&#1497;&#1493;&#1510;&#1512; &#1511;&#1493;&#1489;&#1509; &#1492;&#1502;&#1511;&#1493;&#1512; &#1492;&#1495;&#1491;&#1513; &#1489;&#1514;&#1497;&#1511;&#1497;&#1497;&#1492; &#1492;&#1502;&#1514;&#1488;&#1497;&#1502;&#1492;, &#1493;&#1492;&#1511;&#1493;&#1489;&#1509; &#1492;&#1500;&#1488; &#1502;&#1493;&#1499;&#1503; &#1497;&#1502;&#1495;&#1511; &#1502;&#1502;&#1504;&#1492;.<o:p></o:p></span></p>




</body>
</html>
