<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>



  
  
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">


  
  
  <title>General</title>
</head>


<body style="direction: rtl;">



<h1><big><span style="font-weight: bold;">&#1506;&#1509;
&#1492;&#1491;&#1506;&#1514;</span></big></h1>



&#1506;&#1509; &#1492;&#1491;&#1506;&#1514; &#1492;&#1497;&#1504;&#1492; &#1502;&#1506;&#1512;&#1499;&#1514; &#1500;&#1504;&#1497;&#1492;&#1493;&#1500; &#1502;&#1497;&#1491;&#1506;.<br>



&#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1502;&#1505;&#1508;&#1511;&#1514; &#1513;&#1512;&#1493;&#1514;&#1497;&#1501; &#1513;&#1493;&#1504;&#1497;&#1501; &#1492;&#1502;&#1488;&#1508;&#1513;&#1512;&#1497;&#1501; &#1500;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1497;&#1510;&#1493;&#1512; &#1493;&#1500;&#1504;&#1492;&#1500; &#1491;&#1497;&#1493;&#1504;&#1497;&#1501; &#1513;&#1493;&#1504;&#1497;&#1501; &#1505;&#1489;&#1497;&#1489;
&#1502;&#1505;&#1502;&#1498;&nbsp;&#1513;&#1493;&#1512;&#1513;.<br>



<big><big><small><small><br>



</small></small><span style="font-weight: bold;"><br>



</span></big></big><big><big><span style="font-weight: bold;">&#1514;&#1502;&#1497;&#1499;&#1492; &#1491;&#1493; &#1500;&#1513;&#1493;&#1504;&#1497;&#1514; - </span></big></big><br>



&#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1497;&#1497;&#1502;&#1514; &#1514;&#1502;&#1497;&#1499;&#1492; &#1491;&#1493;-&#1500;&#1513;&#1493;&#1504;&#1497;&#1514; &#1500;&#1506;&#1489;&#1512;&#1497;&#1514; &#1493;&#1488;&#1504;&#1490;&#1500;&#1497;&#1514;.<br>



&#1504;&#1497;&#1514;&#1503; &#1500;&#1492;&#1508;&#1506;&#1497;&#1500; &#1488;&#1514; &#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1489;&#1502;&#1510;&#1489; &#1488;&#1504;&#1490;&#1500;&#1497;&#1514; &#1488;&#1493; &#1489;&#1502;&#1510;&#1489; &#1506;&#1489;&#1512;&#1497;&#1514;. &#1489;&#1513;&#1504;&#1497; &#1492;&#1502;&#1510;&#1489;&#1497;&#1501; &#1504;&#1497;&#1514;&#1503; &#1500;&#1497;&#1510;&#1493;&#1512;
&#1488;&#1500;&#1502;&#1504;&#1496;&#1497;&#1501; &#1513;&#1493;&#1504;&#1497;&#1501; (&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1502;&#1511;&#1493;&#1512;...) &#1489;&#1513;&#1514;&#1497; &#1492;&#1513;&#1508;&#1493;&#1514;.<br>



<br>



&#1489;&#1502;&#1510;&#1489; &#1506;&#1489;&#1512;&#1497;&#1514; &#1502;&#1502;&#1513;&#1511; &#1492;&#1502;&#1506;&#1512;&#1499;&#1514;&nbsp;&#1489;&#1506;&#1489;&#1512;&#1497;&#1514;, &#1493;&#1489;&#1502;&#1510;&#1489; &#1488;&#1504;&#1490;&#1500;&#1497;&#1514;
&#1492;&#1502;&#1502;&#1513;&#1511;&nbsp;&#1489;&#1488;&#1504;&#1490;&#1500;&#1497;&#1514;.<br>



&#1489;&#1502;&#1510;&#1489; &#1506;&#1489;&#1512;&#1497;&#1514; &#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1493;&#1510;&#1497;&#1496;&#1493;&#1496;&#1497;&#1501; &#1497;&#1493;&#1510;&#1490;&#1493; &#1502;&#1497;&#1493;&#1513;&#1512;&#1497;&#1501; &#1500;&#1497;&#1502;&#1497;&#1503;, &#1493;&#1489;&#1502;&#1510;&#1489; &#1488;&#1504;&#1490;&#1500;&#1497;&#1514; &#1492;&#1501; &#1497;&#1493;&#1510;&#1490;&#1493;
&#1502;&#1497;&#1493;&#1513;&#1512;&#1497;&#1501; &#1500;&#1513;&#1502;&#1488;&#1500;.<br>

<br>

&#1497;&#1513; &#1500;&#1492;&#1511;&#1508;&#1497;&#1491; &#1500;&#1488; &#1500;&#1506;&#1489;&#1493;&#1491; &#1506;&#1500; &#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1488;&#1513;&#1512; &#1504;&#1493;&#1510;&#1512; &#1489;&#1502;&#1510;&#1489; &#1488;&#1504;&#1490;&#1500;&#1497;&#1514; &#1489;&#1502;&#1510;&#1489; &#1506;&#1489;&#1512;&#1497;&#1514;, &#1493;&#1500;&#1492;&#1497;&#1508;&#1498;.<br>


<br>



<big><big><span style="font-weight: bold;"></span></big></big><big><big><span style="font-weight: bold;"></span></big></big><span style="font-weight: bold;"></span><span style="font-weight: bold;"><big><big>&#1508;&#1512;&#1505;&#1508;&#1511;&#1496;&#1497;&#1489;&#1492; - <br>

</big></big></span><big><big><small><small>&#1489;&#1505;&#1489;&#1497;&#1489;&#1514; &#1492;&#1506;&#1489;&#1493;&#1491;&#1492;&nbsp;&#1511;&#1497;&#1497;&#1502;&#1514; &#1508;&#1512;&#1505;&#1508;&#1511;&#1496;&#1497;&#1489;&#1492; &#1502;&#1497;&#1493;&#1495;&#1491;&#1514; &#1500;&#1506;&#1509; &#1492;&#1491;&#1506;&#1514;. &#1508;&#1512;&#1505;&#1508;&#1511;&#1497;&#1496;&#1497;&#1489;&#1492; &#1494;&#1493; &#1502;&#1488;&#1508;&#1513;&#1512;&#1514; &#1500;&#1502;&#1513;&#1514;&#1502;&#1513; &#1502;&#1502;&#1513;&#1511; &#1504;&#1493;&#1495; &#1500;&#1506;&#1489;&#1493;&#1491;&#1492; &#1506;&#1501; &#1502;&#1512;&#1499;&#1497;&#1489;&#1497; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;.<br>

<br>

<img style="width: 225px; height: 70px;" alt="perspective" src="../screen_shots/perspective.JPG"><br>

&#1499;&#1488;&#1513;&#1512; &#1502;&#1513;&#1514;&#1502;&#1513; &#1502;&#1489;&#1511;&#1513; &#1500;&#1497;&#1510;&#1493;&#1512; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1506;&#1509; &#1491;&#1506;&#1514; &#1495;&#1491;&#1513; &#1492;&#1493;&#1488; &#1504;&#1513;&#1488;&#1500; &#1492;&#1488;&#1501; &#1489;&#1512;&#1510;&#1493;&#1504;&#1493; &#1500;&#1506;&#1489;&#1493;&#1512; &#1500;&#1508;&#1512;&#1505;&#1508;&#1511;&#1496;&#1497;&#1489;&#1514; &#1506;&#1509; &#1492;&#1491;&#1506;.<br>

&#1489;&#1502;&#1497;&#1491;&#1492; &#1493;&#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1489;&#1493;&#1495;&#1512; &#1513;&#1499;&#1503; &#1488;&#1493; &#1488;&#1501; &#1492;&#1493;&#1488; &#1502;&#1508;&#1506;&#1497;&#1500; &#1488;&#1514; &#1492;&#1508;&#1512;&#1505;&#1508;&#1511;&#1496;&#1497;&#1489;&#1492; "&#1489;&#1488;&#1493;&#1508;&#1503; &#1497;&#1491;&#1504;&#1497;" &#1504;&#1496;&#1506;&#1504;&#1514; &#1492;&#1508;&#1512;&#1505;&#1508;&#1511;&#1496;&#1497;&#1489;&#1492;:<br>

- &#1496;&#1506;&#1497;&#1504;&#1492; &#1513;&#1500; &#1502;&#1489;&#1496; &#1492;&#1502;&#1511;&#1496;&#1506;&#1497;&#1501;<br>

- &#1499;&#1488;&#1513;&#1512; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513; &#1500;&#1493;&#1495;&#1509; &#1506;&#1500; &#1492;&#1500;&#1495;&#1510;&#1503; &#1492;&#1497;&#1502;&#1504;&#1497; &#1493;&#1489;&#1493;&#1495;&#1512; "&#1495;&#1491;&#1513;" &#1492;&#1493;&#1488; &#1497;&#1512;&#1488;&#1492; &#1488;&#1514; &#1499;&#1500; &#1492;&#1488;&#1508;&#1513;&#1512;&#1493;&#1497;&#1493;&#1514;
&#1492;&#1502;&#1511;&#1493;&#1513;&#1512;&#1493;&#1514; &#1500;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;: &#1497;&#1510;&#1497;&#1512;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1495;&#1491;&#1513;, &#1491;&#1497;&#1493;&#1503; &#1495;&#1491;&#1513;, &#1497;&#1495;&#1505; &#1495;&#1491;&#1513;, &#1511;&#1497;&#1513;&#1493;&#1512; &#1489;&#1497;&#1503; &#1491;&#1497;&#1493;&#1503;
&#1500;&#1513;&#1493;&#1512;&#1513;, &#1502;&#1511;&#1493;&#1512; &#1502;&#1496;&#1511;&#1505;&#1496;.<br>

-&#1504;&#1497;&#1514;&#1503; &#1500;&#1492;&#1508;&#1506;&#1497;&#1500; &#1488;&#1514; &#1502;&#1489;&#1496; &#1492;&#1502;&#1511;&#1496;&#1506;&#1497;&#1501; &#1489;&#1488;&#1493;&#1508;&#1503; &#1504;&#1493;&#1495; &#1490;&#1501; &#1491;&#1512;&#1498; &#1514;&#1508;&#1512;&#1497;&#1496; "&#1495;&#1500;&#1493;&#1503;".<br>

</small></small></big></big><span style="font-weight: bold;"><br>

</span><br>



&nbsp;
</body>
</html>
