<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>





  
  
  
  
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">




  
  
  
  
  <title>Getting Started</title>
</head>


<body style="direction: rtl;">





<div style="text-align: right;"><big style="font-weight: bold;"><big>&#1497;&#1510;&#1497;&#1512;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; -
</big></big><br>





&#1497;&#1510;&#1497;&#1512;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1495;&#1491;&#1513; &#1513;&#1500; &#1506;&#1509; &#1492;&#1491;&#1506;&#1514; &#1497;&#1514;&#1489;&#1510;&#1506; &#1489;&#1488;&#1493;&#1508;&#1503; &#1492;&#1489;&#1488;:<br>





<br>





&#1497;&#1513; &#1500;&#1490;&#1513;&#1514; &#1500;&#1514;&#1508;&#1512;&#1497;&#1496; &#1511;&#1493;&#1489;&#1509; --&gt; &#1495;&#1491;&#1513; --&gt; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;.<br>





&#1499;&#1506;&#1514; &#1497;&#1497;&#1508;&#1514;&#1495; &#1488;&#1513;&#1507; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1495;&#1491;&#1513;.<br>





&#1497;&#1513; &#1500;&#1489;&#1495;&#1493;&#1512; &#1489;&#1514;&#1497;&#1511;&#1497;&#1497;&#1514; "&#1502;&#1497;&#1491;&#1506;" &#1493;&#1514;&#1495;&#1514;&#1497;&#1492; "&#1506;&#1509; &#1491;&#1506;&#1514;" &#1493;&#1500;&#1500;&#1495;&#1493;&#1509; &#1506;&#1500; &#1499;&#1508;&#1514;&#1493;&#1512; "&#1492;&#1489;&#1488;".<br>





<img style="width: 525px; height: 500px;" alt="new_proj1" src="../screen_shots/new_proj1.jpg"><br>





<br>





<br>





&#1489;&#1495;&#1500;&#1493;&#1503; &#1492;&#1489;&#1488; &#1513;&#1500; &#1492;&#1488;&#1513;&#1507; &#1497;&#1513; &#1500;&#1502;&#1500;&#1488; &#1488;&#1514; &#1492;&#1513;&#1491;&#1493;&#1514;:<br>





&#1513;&#1501; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1513;&#1501; &#1497;&#1493;&#1510;&#1512; &#1493;&#1511;&#1493;&#1489;&#1509; &#1492;&#1513;&#1493;&#1512;&#1513; (&#1511;&#1493;&#1489;&#1509; &#1489;&#1508;&#1493;&#1512;&#1502;&#1496; XML &#1506;&#1501; &#1505;&#1497;&#1493;&#1502;&#1514; src).<br>





&#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1500;&#1488; &#1514;&#1488;&#1508;&#1513;&#1512; &#1500;&#1508;&#1514;&#1493;&#1495; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1506;&#1501; &#1513;&#1501; &#1513;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1513;&#1499;&#1489;&#1512; &#1511;&#1497;&#1497;&#1501;.<br>





&#1511;&#1493;&#1489;&#1509; &#1492;&#1513;&#1493;&#1512;&#1513; &#1492;&#1504;&#1489;&#1495;&#1512; &#1497;&#1492;&#1493;&#1493;&#1492; &#1488;&#1514; &#1502;&#1512;&#1499;&#1494; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;.&nbsp;&#1505;&#1489;&#1497;&#1489;&#1493; &#1497;&#1514;&#1508;&#1514;&#1495;&#1493; &#1489;&#1513;&#1500;&#1489;
&#1502;&#1488;&#1493;&#1495;&#1512; &#1497;&#1493;&#1514;&#1512; &#1492;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501;.<br>



&#1504;&#1497;&#1514;&#1503;, &#1488;&#1498; &#1500;&#1488; &#1502;&#1493;&#1502;&#1500;&#1509;, &#1500;&#1497;&#1510;&#1493;&#1512; &#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1500;&#1500;&#1488; &#1513;&#1493;&#1512;&#1513;&#1497;&#1501; &#1489;&#1499;&#1500;&#1500;.<br>





<br>





&#1500;&#1488;&#1495;&#1512; &#1502;&#1497;&#1500;&#1493;&#1497; &#1492;&#1513;&#1491;&#1493;&#1514; &#1497;&#1513; &#1500;&#1500;&#1495;&#1493;&#1509; &#1506;&#1500; &#1499;&#1508;&#1514;&#1493;&#1512; "&#1505;&#1497;&#1493;&#1501;".<br>





<img style="width: 525px; height: 500px;" alt="new_proj2" src="../screen_shots/new_proj2.jpg"><br>





<br>





<br>





<br>





&#1506;&#1501; &#1505;&#1490;&#1497;&#1512;&#1514; &#1492;&#1488;&#1513;&#1507; &#1497;&#1493;&#1493;&#1510;&#1512; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1506;&#1509; &#1491;&#1506;&#1514; &#1495;&#1491;&#1513; &#1489;&#1513;&#1501; &#1513;&#1504;&#1489;&#1495;&#1512;.<br>





<img style="width: 215px; height: 294px;" alt="new_proj3" src="../screen_shots/new_proj3.jpg"><br>





<br>





<br>





&#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1492;&#1495;&#1491;&#1513; &#1497;&#1513;&#1504;&#1501; &#1502;&#1505;&#1508;&#1512; &#1511;&#1489;&#1510;&#1497;&#1501;:<br>



*&nbsp;&#1514;&#1497;&#1511;&#1497;&#1497;&#1514; "&#1491;&#1497;&#1493;&#1504;&#1497;&#1501;" (Discussions) &#1513;&#1514;&#1499;&#1497;&#1500; &#1488;&#1514; &#1492;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501;.<br>

* &#1514;&#1497;&#1511;&#1497;&#1497;&#1514; "&#1497;&#1510;&#1497;&#1512;&#1492;" (Unparsed) &#1488;&#1513;&#1512; &#1514;&#1499;&#1497;&#1500; &#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1489;&#1513;&#1500;&#1489;&#1497; &#1497;&#1510;&#1497;&#1512;&#1492; ("Parsing")<br>



* &#1514;&#1497;&#1511;&#1497;&#1497;&#1514; "&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;" (Sources)
&#1513;&#1514;&#1499;&#1497;&#1500; &#1488;&#1514; &#1499;&#1500; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;.<br>



* &#1514;&#1497;&#1511;&#1497;&#1497;&#1514; "&#1513;&#1493;&#1512;&#1513;" (Root) &#1513;&#1514;&#1499;&#1497;&#1500; &#1488;&#1514; &#1492;&#1513;&#1493;&#1512;&#1513;, &#1488;&#1513;&#1512; &#1506;&#1513;&#1493;&#1497; &#1500;&#1492;&#1497;&#1493;&#1514; &#1502;&#1493;&#1512;&#1499;&#1489; &#1502;&#1502;&#1505;&#1508;&#1512; &#1511;&#1489;&#1510;&#1497;&#1501;.<br>



* &#1511;&#1493;&#1489;&#1509; links.xml, &#1492;&#1502;&#1499;&#1497;&#1500; &#1488;&#1514; &#1492;&#1511;&#1497;&#1513;&#1493;&#1512;&#1497;&#1501; &#1489;&#1497;&#1503; &#1492;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501; &#1500;&#1513;&#1493;&#1512;&#1513;&#1497;&#1501; (&#1500;&#1488; &#1504;&#1497;&#1514;&#1503; &#1500;&#1506;&#1512;&#1497;&#1499;&#1492; &#1489;&#1490;&#1512;&#1505;&#1492; &#1494;&#1493; &#1513;&#1500; &#1492;&#1502;&#1493;&#1510;&#1512;).<br>



* &#1511;&#1493;&#1489;&#1509; authors.xml &#1492;&#1502;&#1499;&#1497;&#1500; &#1488;&#1514; &#1492;&#1491;&#1497;&#1512;&#1493;&#1490;&#1497;&#1501; &#1513;&#1500; &#1492;&#1502;&#1495;&#1489;&#1512;&#1497;&#1501; &#1492;&#1513;&#1493;&#1504;&#1497;&#1501; (&#1500;&#1488; &#1504;&#1497;&#1514;&#1503; &#1500;&#1506;&#1512;&#1497;&#1499;&#1492; &#1489;&#1490;&#1512;&#1505;&#1492; &#1494;&#1493; &#1513;&#1500; &#1492;&#1502;&#1493;&#1510;&#1512;). <br>





<br>




<big><big><small><small><br>



<br>





</small></small></big></big><span lang="HE"><o:p></o:p></span>
<big><big><span style="font-weight: bold;"></span></big></big><span lang="HE"><o:p></o:p></span>
<span style="font-weight: bold;"></span></div>





</body>
</html>
